IDEA Open Model
ConcreteMemberData Class
Compatible with IDEA StatiCa Beta 20.0
 Concrete member data base
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenAttribute
 IdeaRS.OpenModel.Concrete.ConcreteMemberData
 IdeaRS.OpenModel.Concrete.ConcreteMemberDataEc2
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public abstract class ConcreteMemberData : OpenAttribute
Public MustInherit Class ConcreteMemberData
	Inherits OpenAttribute
The ConcreteMemberData type exposes the following members.
Constructors
Name | Description
ConcreteMemberData
 Constructor
Top
Properties
Name | Description
CalculationSetup
 Calculation setup
Element
 Element for attribute
 (Inherited from OpenAttribute.)
MemberType
 Gets or sets the structural type of member.
TimeAxis
 Time axis
TwoWaySlabType
 two way slab type
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace